Show / Hide Table of Contents
Class Element2D
Representation of element2D
Inheritance
System.Object
OpenObject
OpenElementId
Element2D
Wall
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Structure.Element2D,CI.StructuralElements", "CI.StructModel.Structure.IElement2D,CI.BasicTypes")]
public class Element2D : OpenElementId
Constructors
Improve this Doc   View Source
Element2D()
Constructor
Declaration
public Element2D()
Properties
Improve this Doc   View Source
EccentricityZ
Displacement in local axis Z
Declaration
public double EccentricityZ { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
ElementType
Analysis type - shell, plate, wall
Declaration
public Element2DType ElementType { get; set; }
Property Value
 Type |  Description
 Element2DType
Improve this Doc   View Source
GeometricRegion
Geometry region of element2D
Declaration
public ReferenceElement GeometricRegion { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
InnerLines
Inner lines of this region
Declaration
public List<ReferenceElement> InnerLines { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ReferenceElement>
Improve this Doc   View Source
InnerPoints
Inner points of this region
Declaration
public List<ReferenceElement> InnerPoints { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ReferenceElement>
Improve this Doc   View Source
Material
Material
Declaration
public ReferenceElement Material { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
Thickness
Thicknes of Element2D
Declaration
public double Thickness { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source